#pragma once

#include "ImageSpaceModifierInstance.hpp"

class ImageSpaceModifierInstanceDRB : public ImageSpaceModifierInstance {
public:
	float					flt1C;			// 1C
	float					flt20;			// 20
	float					flt24;			// 24
	float					flt28;			// 28
	float					flt2C;			// 2C
	UInt32					unk30;			// 30
	UInt32					unk34;			// 34
	float					flt38;			// 38
	float					flt3C;			// 3C
	UInt32					unk40;			// 40
};